Revit 2026 API

# StructuralFramingUtilsDisallowJoinAtEnd Method

---

Sets the indicated end of the framing element to not be allowed to join to others.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void DisallowJoinAtEnd(
	FamilyInstance familyInstance,
	int end
)
```
```vb
Public Shared Sub DisallowJoinAtEnd (
	familyInstance As FamilyInstance,
	end As Integer
)
```
```cpp
public:
static void DisallowJoinAtEnd(
	FamilyInstance^ familyInstance,
	int end
)
```
```fsharp
static member DisallowJoinAtEnd :
        familyInstance : FamilyInstance *
        end : int -> unit
```

#### Parameters

familyInstance FamilyInstance
     The FamilyInstance, which must be of a structural framing category.
end Int32
     The index of the end (0 for the start, 1 for the end).

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | end must be 0 or 1. |
| ArgumentsInconsistentException | The input familyInstance is not of a structural framing category. |

If this framing element is already joined at this end, it will become disconnected.

#### Reference

StructuralFramingUtils Class

Autodesk.Revit.DB.Structure Namespace